{
  "summary": "MS in Applied Data Analytics student at Boston University with a strong foundation in mathematics and computer science. Experienced in developing quantitative trading strategies, data analysis, and machine learning applications. Proven ability to lead projects and collaborate effectively in team environments. Currently pursuing the CFA Level 1 certification and working on research and analysis in cryptocurrency and blockchain technologies.",
  "work_experience": [
    {
      "role": "Research Assistant",
      "organization": "Boston University, Department of Computer Science",
      "location": "Boston, MA",
      "dates": "Oct 2024 - Present",
      "description": [
        "Developed and back-tested proprietary trading strategies comparing Mean Absolute Deviation (MAD) vs. Markowitz mean-variance optimization across 9 sector ETFs, implementing risk-constrained portfolio construction and rebalancing algorithms with associated performance analytics including Sharpe ratios, MDD, and transaction cost analysis for alpha generation.",
        "Conducted research on momentum-based trading strategies in crude oil ETFs and futures, developing long-short models yielding up to 19.9% annualized returns over an 18-year testing period. Published in Stocks & Commodities Magazine (September 2025) as 'Momentum-Based Trading Strategies in Crude Oil ETFs And Futures' (Shah, S., & Pinsky, E).",
        "Developed a strategy leveraging overnight silver returns to predict Bitcoin price movements, exhibiting lower drawdowns in a 10-year backtest. Published in Stocks & Commodities Magazine (June 2025) as 'The Silver Lining of Daily Bitcoin Trading' (Shah, S., & Pinsky, E.).",
        "Developed probabilistic framework to reduce computational overhead in model fine-tuning, using various distributions to estimate Random Forest performance, achieving less than 3% relative error size across varying configurations. Published as 'Estimating the Accuracy of a Bagged Ensemble' (Shah, S., & Pinsky, E.) (DOI:10.5121/mlaij.2025.12106)."
      ],
      "skills": ["Advanced Python", "scikit-learn", "Pandas", "NumPy", "Matplotlib", "Seaborn", "PyTorch", "TensorFlow", "R", "SQL", "Git", "Outlier detection", "Feature engineering", "Modular architecture", "multi-dimensional dataset transformation", "Strategy Testing", "Back-testing", "Research"]
    },
    {
      "role": "Program Operations Intern",
      "organization": "Raising A Mathematician Foundation",
      "location": "Mumbai, India",
      "dates": "Jul 2024 - Aug 2024",
      "description": [
        "Spearheaded the Maths Circle Initiative by RAM Foundation in India, leading a team of five overlooking data-driven business expansion and leveraging analysis of applicant data to identify high-potential markets for educational programs.",
        "Implemented project management infrastructure using Jira, Confluence, and Slack to streamline task tracking, documentation, and communication between cross-functional teams."
      ],
      "skills": ["Python", "Microsoft Office (Advanced Excel & VBA, Word, PowerPoint)", "Jira", "Confluence", "Leadership"]
    },
    {
      "role": "Data Science Intern",
      "organization": "Fino Payments Bank",
      "location": "Mumbai, India",
      "dates": "May 2023 - Jul 2023",
      "description": [
        "Built a database of 6,000+ government-sponsored financial schemes, leveraging PySpark and pattern recognition on customer-level transaction data, to generate analytical insights and presented a revenue growth strategy could 2x revenue."
      ],
      "skills": ["Python (PySpark)", "R", "SQL", "Microsoft Office (Advanced Excel & VBA, Word, PowerPoint)", "stakeholder communication"]
    },
    {
      "role": "Mathematics & Physics Teacher",
      "organization": "Greater Mumbai Science Teachers' Association",
      "location": "Mumbai, India",
      "dates": "May 2023 - Jul 2023",
      "description": [
        "Helped students prepare for the various stages leading up to the International Junior Science Olympiad."
      ],
      "skills": ["Quantitative reasoning", "Data interpretation", "Scientific communication", "Leadership and mentorship"]
    }
  ],
  "education": [
    {
      "degree": "MS in Applied Data Analytics",
      "institution": "Boston University",
      "location": "Boston, MA",
      "courses": ["Analytics and Data Visualization in R", "Advanced Machine Learning", "Big Data Analytics", "Web Mining & Graph Analytics"]
    },
    {
      "degree": "BS (Honors) in Mathematics & Computer Science",
      "institution": "Chennai Mathematical Institute",
      "location": "Chennai, India",
      "courses": ["Linear Algebra", "Fourier Analysis", "Data Structures and Algorithms", "Probability Theory & Statistics", "Stochastic Processes", "Statistical Inference", "Financial Modelling", "Economics"]
    }
  ],
  "awards_certifications": [
    {
      "name": "CFA Society Boston Candidate Scholarship for CFA Level 1",
      "date": "Jun 2025"
    },
    {
      "name": "Bloomberg Finance Fundamentals Certification",
      "certificate_id": "hMwkGGrPk7QVfKpcgt9E4UQJ",
      "date": "Feb 2025"
    },
    {
      "name": "DeepLearning.AI with OpenAI and LangChain | Building LLM Applications & RAG Systems",
      "date": "Jan 2025"
    },
    {
      "name": "Department of Science & Technology, Government of India | INSPIRE Fellowship",
      "date": "Sep 2021"
    }
  ],
  "projects": [
    {
      "title": "Greek Vase Volume Analysis Using Mathematical Modeling",
      "publication_at": "MDPI Journal (Metrology)",
      "date": "November 2025",
      "associated_with": {
        "role": "Research Assistant",
        "organization": "Boston University, Department of Computer Science",
        "team_members": [
          "Siddhant Shah",
          "Minfei Liang",
          "Eugene Pinsky"
        ]
      },
      "details": {  
        "overview": {
          "description": "Advanced interdisciplinary research project combining mathematical modeling, statistical analysis, Python programming, and data analytics to solve a centuries-old archaeological problem: accurately computing volumes of ancient Greek vases using geometric principles and modern computational methods.",
          "objective": "Develop an accurate, practical method for computing volumes of ancient Greek amphorae using mathematical modeling and computational methods",
          "significance": "Enables large-scale analysis of 130,000+ vases in Beazley Archive database and supports archaeological research on ancient trade and economic activity"
        },
        "business_problem": {
          "historical_context": "Ancient Greek amphorae were critical for trade and commerce, used for storing and transporting wine, olive oil, and grain",
          "research_motivation": "Accurate volume measurement is essential for understanding economic activity, trade patterns, and consumption estimates in antiquity",
          "technical_challenges": [
            "Direct volume measurement is infeasible due to age and fragility of artifacts",
            "Many specimens are incomplete (fragments only)",
            "Museum preservation restrictions limit physical manipulation",
            "Over 130,000 vases cataloged in Beazley Archive require systematic analysis"
          ],
          "market_relevance": "Similar analytical challenges exist in container logistics, 3D modeling applications, and industrial volume estimation"
        },
        "methodology": {
          "data_collection": {
            "dataset_size": "25+ ancient Greek amphorae from Boston Museum of Fine Arts",
            "data_source": "Lacey Caskey's measurements from 'A Geometry of Greek Vases' (1920s)",
            "key_metrics_extracted": [
              "Height, width, diameter measurements",
              "Geometric ratios (Golden Ratio φ, √2, √3, √5)",
              "Cross-sectional profiles and contour data"
            ]
          },
          "mathematical_modeling": {
            "hypothesis": "Greek vase contours follow logarithmic spiral equations based on 'dynamic symmetry' principles",
            "model_components": [
              "Derived closed-form mathematical formulas for volume calculation",
              "Developed parametric equations with parameters: α (growth rate), β (rotation), c (scaling factor), θ (angular coordinates)",
              "Created exact analytical solution using integral calculus for volumes of revolution"
            ],
            "key_parameters": {
              "alpha_growth_rate": "Range: -0.13 to 0.07 (spiral growth rate)",
              "beta_rotation": "Range: -0.06 to 0.05 (rotation factor)",
              "c_scaling_factor": "Range: 0.15 to 0.24 (scaling constant)"
            }
          },
          "statistical_analysis": {
            "method": "t-Test Analysis",
            "sample_size": 25,
            "t_statistic": 0.66,
            "p_value": 0.52,
            "degrees_of_freedom": 24,
            "significance_level": "95%",
            "conclusion": "Failed to reject null hypothesis, validating approximation simplifications"
          },
          "computational_implementation": {
            "language": "Python",
            "key_libraries": [
              "NumPy - numerical computing",
              "SciPy - optimization algorithms",
              "Additional optimization libraries for parameter estimation"
            ],
            "techniques_used": [
              "Numerical optimization",
              "Parameter estimation",
              "Least-squares fitting",
              "Gradient descent optimization",
              "Numerical integration",
              "Coordinate transformation and normalization"
            ]
          },
          "approximation_methods": [
            {
              "name": "Single Frustum",
              "mean_relative_error": "15-20%",
              "complexity": "Low",
              "use_case": "Quick estimates"
            },
            {
              "name": "Two Frustums",
              "mean_relative_error": "8-12%",
              "complexity": "Medium",
              "use_case": "Better accuracy"
            },
            {
              "name": "Semi-Ellipsoid (Optimal)",
              "mean_relative_error": "4.91%",
              "complexity": "Medium",
              "use_case": "Optimal balance - recommended for practical applications"
            }
          ]
        },
        "key_formula": {
          "description": "Simplified volume formula for practical application",
          "body_volume": "V ≈ (2π/3) × (widest radius)² × (body height)",
          "neck_volume": "V_neck ≈ (3π/4) × (neck diameter)² × (neck height)",
          "total_volume": "V_total = V_body + V_neck",
          "measurements_required": -1,
          "practical_applications": [
            "Large-scale archaeological database analysis",
            "Rapid estimation without complex calculations",
            "Historical trade volume reconstruction",
            "Museum cataloging and valuation"
          ]
        },
        "quantitative_results": {
          "validation_metrics": {
            "sample_size": 25,
            "accuracy_confidence": "95%",
            "best_model_performance": "4.91% mean relative error (semi-ellipsoid)",
            "validation_baselines": [
              "Web-based volume calculation tool (Université Libre de Bruxelles)",
              "Getty Museum reported volumes"
            ]
          },
          "statistical_significance": {
            "t_statistic": 0.66,
            "p_value": 0.52,
            "null_hypothesis": "Model simplification is valid",
            "conclusion": "Null hypothesis not rejected at 95% significance level"
          }
        },
        "technical_skills_demonstrated": {
          "quantitative_and_analytical": [
            "Advanced Mathematics (Calculus, differential equations, analytical geometry)",
            "Statistical Analysis (Hypothesis testing, t-tests, error analysis, confidence intervals)",
            "Optimization Theory (Constrained optimization, parameter estimation, numerical methods)",
            "Data Modeling (Parametric modeling, regression analysis, model validation)"
          ],
          "technical_and_programming": [
            "Python Proficiency (NumPy, SciPy, optimization algorithms, numerical computing)",
            "Data Processing (Data extraction, normalization, coordinate systems, transformations)",
            "Algorithm Development (Numerical integration, iterative refinement, convergence analysis)",
            "Documentation (LaTeX, reproducible research methodology)"
          ],
          "research_and_problem_solving": [
            "Problem Decomposition (Breaking complex problems into tractable components)",
            "Hypothesis Development (Formulating testable conjectures from observations)",
            "Cross-disciplinary Integration (Combining art history, mathematics, computer science)",
            "Validation & Verification (Multiple validation approaches including external benchmarks)"
          ],
          "business_and_communication": [
            "Practical Application Focus (Developing simple formulas for real-world implementation)",
            "Stakeholder Consideration (Recognizing needs of archaeologists, museums, historians)",
            "Documentation (Comprehensive technical paper for peer review)",
            "Visual Communication (50+ figures and tables for data presentation)"
          ]
        },
        "transferable_skills_for_investment_analysis": {
          "financial_modeling": "Mathematical rigor applied to pricing models, risk analysis, portfolio optimization",
          "data_driven_decision_making": "Validated hypotheses with quantitative evidence, similar to investment thesis validation",
          "model_validation": "Rigorous backtesting and error analysis—critical for trading strategies and valuation models",
          "programming_for_finance": "Python skills directly applicable to quantitative finance, algorithmic trading, risk management",
          "statistical_inference": "Hypothesis testing framework used in market research, factor analysis, regression studies",
          "approximation_methods": "Balancing accuracy vs. simplicity—essential for creating usable financial models",
          "parameter_estimation": "Similar to estimating beta, volatility, correlation matrices in portfolio construction"
        },
        "project_impact": {
          "academic_contribution": [
            "First mathematical framework for universal Greek vase volume calculation",
            "Validated hypothesis connecting dynamic symmetry to logarithmic spirals",
            "Provided simple, historically accurate volume estimation method"
          ],
          "practical_impact": [
            "Enables large-scale analysis of 130,000+ vases in Beazley Archive database",
            "Supports archaeological research on ancient trade and economic activity",
            "Creates standardized methodology for museum cataloging"
          ],
          "methodological_innovation": [
            "Combined historical art theory with modern computational mathematics",
            "Demonstrated how ancient geometric principles can be formalized mathematically",
            "Provided template for applying quantitative methods to humanities research"
          ]
        },
        "value_proposition_for_employers": {
          "quantitative_rigor": "Comparable to sell-side equity research standards",
          "programming_proficiency": "Needed for quantitative analyst roles",
          "statistical_methodology": "Required for data-driven investing",
          "model_development": "Essential for portfolio optimization",
          "problem_solving_creativity": "Valuable for identifying investment opportunities"
        }
      }
    },
    {
      "title": "Momentum-based Trading Strategies in Crude Oil ETFs and Futures",
      "published_at": "Stocks and Commodities September 2025 Issue",
      "date": "September 2025",
      "associated_with": {
        "role": "Research Analyst",
        "organization": "Boston University, Department of Computer Science, Metropolitan College",
        "team_members": [
          "Siddhant Shah",
          "Eugene Pinsky, PhD"
        ]
      },
      "details": [
        "Designed and backtested momentum-based trading strategies across USO (ETF) and CL=F (futures) from 2007-2024, achieving 10.6% annual returns on ETF strategies and 19.9% on futures strategies versus -8.6% for buy-and-hold baseline.",
        "Implemented multi-window momentum analysis (Trading Day, Overnight, Open-to-Open, Close-to-Close) with both long-only and long-short strategies, identifying overnight period as critical for price discovery and signal generation.",
        "Developed Python-based backtesting framework using pandas and numpy to evaluate 120+ strategy variations, demonstrating shorting capabilities enhance returns by 165% (from 4.0% to 10.6%) while managing drawdown risk.",
        "Quantified risk-return characteristics across instruments: futures strategies generated 2x returns of ETF strategies but with 1.46x higher maximum drawdowns, informing risk-adjusted portfolio construction decisions.",
        "Discovered mean-reversion effects in futures market, with contrarian strategies ranking in top 5 performers (13.6% and 11.4% annual returns), suggesting profit opportunities from time-window arbitrage.",
        "Technical implementation: Yahoo Finance data processing, time series analysis across 4,522 trading days, performance metrics calculation, and strategy comparison framework for institutional-scale algorithmic trading deployment."
      ]
    },
    {
      "title": "The Silver Lining of Daily Bitcoin Trading",
      "published_at": "Stocks and Commodities July 2025 Issue",
      "date": "July 2025",
      "associated_with": {
        "role": "Research Analyst",
        "organization": "Boston University, Department of Computer Science, Metropolitan College",
        "team_members": ["Eugene Pinsky", "Siddhant Shah"]
      },
      "details": [
        "Engineered daily trading strategy leveraging overnight silver price movements to predict 24-hour Bitcoin close-to-close returns, achieving 68.65% average annual returns over 10 years versus 58.69% buy-and-hold baseline.",
        "Implemented cross-asset signal generation: positive overnight silver returns trigger Bitcoin long positions; non-positive returns trigger cash positions, requiring only OHLC data and minimal computational overhead for retail investor implementation.",
        "Backtested strategy across 2014-2024 market cycles (3,652 trading days) with key finding: strategy sacrifices 16.4% upside in bull markets (avg 68.65% vs 58.69%) but reduces downside by 50% in bear markets and provides significant drawdown mitigation.",
        "Quantified risk-adjusted performance: maximum drawdowns reduced from average 51.2% (buy-and-hold) to 33.8% (strategy), demonstrating 34% lower volatility while maintaining competitive returns during market downturns.",
        "$100 initial investment analysis: buy-and-hold grew to $11,589.68; strategy grew to $23,048.77 (99% higher 10-year return), showing superior long-term compounding despite lower annual returns in bull years.",
        "Identified distinct performance regimes: strategy outperforms 40% of years (negative return years: 2014, 2018, 2022 where losses contained to -17.84% to -47.70% vs -61.00% to -72.41%), demonstrating defensive properties and non-correlated silver relationship for portfolio diversification."
      ]
    },
    {
      "title": "Estimating the Accuracy of a Bagged Ensemble",
      "published_at": "MLAIJ Journal (DOI:10.5121/mlaij.2025.12106)",
      "date": "May 2025",
      "associated_with": {
        "role": "Research Analyst",
        "organization": "Boston University, Department of Computer Science, Metropolitan College",
        "team_members": [
          "Siddhant Shah",
          "Eugene Pinsky, PhD"
        ]
      },
      "details": [
        "Developed probabilistic framework to predict ensemble accuracy for bagged classifiers using Bernoulli distributions and majority voting theory, enabling data scientists to determine optimal ensemble size without exhaustive trial-and-error experimentation.",
        "Derived mathematical formulations based on Condorcet's Jury Theorem for ensemble voting dynamics, proving ensemble outperforms individual learners only when weak learner accuracy exceeds 50% threshold.",
        "Implemented three statistical approximation approaches (Poisson, Normal, and Binomial distributions) for finite ensemble accuracy prediction, achieving 2.22% mean absolute relative error using ensemble averaging method.",
        "Extended framework from identical weak learners to heterogeneous classifiers using Poisson-Binomial distribution theory, enabling practical application to real-world random forests and bagging algorithms with varying individual accuracies.",
        "Validated methodology on Iris dataset with Random Forest ensembles (depth=1), demonstrating prediction accuracy within 7.5% mean relative error across ensemble sizes 11-51, supporting scalable ensemble sizing decisions.",
        "Technical implementation: Python-based statistical modeling with gamma function analysis, incomplete gamma function computation, Central Limit Theorem applications, and accuracy prediction formulas for institutional algorithmic training."
      ]
    },
    {
      "title": "PySpark vs KDB+/q",
      "published_at": "https://github.com/SidShah2953/pyspark-vs-q",
      "date": "May 2025",
      "associated_with": {
        "role": "MS in Applied Data Analytics",
        "organization": "Boston University, Department of Computer Science"
      },
      "details": [
        "Developed high-performance financial analytics system using KDB+/q, achieving 50-300x performance improvements over traditional big databases for time-series operations including VWAP calculations and market data ingestion (10M+ records).",
        "Engineered comparative performance benchmarks between KDB+/q and PySpark for market data processing, demonstrating microsecond-level query response times and 5-8x memory compression ratios for financial datasets."
      ]
    },
    {
      "title": "F1 Lap Time Prediction and Feature Analysis",
      "published_at": "https://github.com/SidShah2953/F1-Telemetry-Analysis",
      "date": "Dec 2024",
      "associated_with": {
        "role": "MS in Applied Data Analytics",
        "organization": "Boston University, Department of Computer Science"
      },
      "details": [
        "Developed end-to-end quantitative trading strategy framework for F1 lap time prediction using real-time telemetry data, implementing advanced feature engineering techniques including time-series quantization, to achieve 94.8% R².",
        "Engineered sophisticated multi-dimensional features by constructing complex interactions from 20+ variables including track curvature, elevation profiles, and driver performance and performed statistical analysis using ANOVA and hypothesis testing.",
        "Identified the Top 5 most influential features: Track Length (56.40%), Elevation Standard Deviation (14.58%), Total Elevation Change (6.23%), Curvature Standard Deviation (5.17%), Number of Corners (4.16%)",
        "Performed a statistical comparison between Max Verstappen and Lando Norris using multiple linear regression models to analyse their driving styles and performance characteristics. Track Complexity Management: Verstappen shows more consistent performance on complex tracks Lower sensitivity to number of corners and maximum curvature More efficient adaptation to track characteristics Tire Management Verstappen demonstrates superior tire management. Tire Management: Verstappen demonstrates superior tire management, Lower lap time degradation with tire wear More consistent performance across tire compounds Performance Factors Different sensitivity to track temperatures and weather conditions"
      ]
    }
  ],
  "leadership_volunteering": [
    {
      "role": "Financial Literacy Volunteer",
      "organization": "CFA Society Boston",
      "dates": "Jul 2024 - Present"
    },
    {
      "role": "Executive Board Member",
      "organization": "Boston University Machine Intelligence Community",
      "dates": "Oct 2024 - May 2025",
      "description": [
        "Organized and conducted hands-on workshops on applications of machine learning and AI topics in Finance."
      ]
    },
    {
      "role": "Overall Coordinator",
      "organization": "Tessellate (Chennai Mathematical Institute)",
      "dates": "Oct 2022 - May 2024",
      "description": [
        "Led multiple teams, overlooking all aspects of finance, design & marketing, tech & IT and event organization."
      ]
    }
  ]
}
